In [1]:
from sqlalchemy import create_engine
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
database_name = 'scooters'    

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100
'''
pd.read_sql(query, con = engine)

#test query, just trying to make sure I can pull up a query

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [5]:
scooters = pd.read_sql(query, con = engine)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [6]:
totalscoots = '''
SELECT COUNT(DISTINCT(sumdid))
FROM scooters;
'''

totalscoots = pd.read_sql(totalscoots, con = engine)
totalscoots

#query to see how many scooters there are.

   count
0  10018

In [ ]:
scootspercompany = '''
SELECT companyname, COUNT(DISTINCT(sumdid))
FROM scooters
GROUP BY companyname;
'''
scoots = pd.read_sql(scootspercompany, con = engine)
scoots

# query to see how many scooters there are per company

In [8]:
timerangeofscooting = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters
'''
scooterstimeframe = pd.read_sql(timerangeofscooting, con = engine)
scooterstimeframe


#used this to see minumum and maximum time the scooters were used

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [9]:
JUSTSCOOTERS = '''
SELECT *
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
AND SUMDID = 'Powered3c24659f-37f5-5549-895c-bccf6d1ab656'
'''
SCOOTERSONLY = pd.read_sql_query(JUSTSCOOTERS , engine)
SCOOTERSONLY.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-17 10:17:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
1,2019-05-17 10:22:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
2,2019-05-17 10:27:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
3,2019-05-17 10:32:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
4,2019-05-18 14:03:13,36.1538,-86.7957,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,0.0,scooter,0.0,Jump

The purpose of the cell above was to remove the bicycles that were appearing in the data that we were pulling.

In [10]:
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP),
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS 
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
---SUMDID ='Powered3c24659f-37f5-5549-895c-bccf6d1ab656'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)
SCOOTERSONLY1

      upper companyname month_num month_name year_val  count
0   SCOOTER        BIRD        05  MAY           2019   3064
1   SCOOTER        BIRD        06  JUNE          2019   2910
2   SCOOTER        BIRD        07  JULY          2019   2583
3   SCOOTER        BOLT        05  MAY           2019    346
4   SCOOTER        BOLT        06  JUNE          2019    333
5   SCOOTER        BOLT        07  JULY          2019    276
6   SCOOTER      GOTCHA        05  MAY           2019    223
7   SCOOTER      GOTCHA        06  JUNE          2019    223
8   SCOOTER      GOTCHA        07  JULY          2019    224
9   SCOOTER        JUMP        05  MAY           2019    976
10  SCOOTER        JUMP        06  JUNE          2019   1036
11  SCOOTER        JUMP        07  JULY          2019   1206
12  SCOOTER        LIME        05  MAY           2019   1631
13  SCOOTER        LIME        06  JUNE          2019   1455
14  SCOOTER        LIME        07  JULY          2019    902
15  SCOOTER        LYFT        05  MAY           2019   1376
16  SCOOTER        LYFT        06  JUNE          2019   1152
17  SCOOTER        LYFT        07  JULY          2019   1026
18  SCOOTER        SPIN        05  MAY           2019    687
19  SCOOTER        SPIN        06  JUNE          2019    713
20  SCOOTER        SPIN        07  JULY          2019    570

This cell above shows the amount of scooters that each company had under the time frame given. (3 months)

In [11]:
 = '''
SELECT companyname, sumdid, COUNT(tripduration) as tripduration_count
FROM trips
WHERE tripduration > 1440
GROUP BY sumdid, companyname
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

SyntaxError: invalid syntax (1286083668.py, line 1)

2.

According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:
Removal of staff servicing and test trips
Removal of trips below one minute
Trip lengths are capped at 24 hours
Are the scooter companies in compliance with the second and third part of this rule?

In [ ]:
companiesnotcompliant = '''
SELECT 'over 24' as status, companyname
FROM trips
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'under 1 minute' as status, companyname
FROM trips
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status
'''
scooterstriptime= pd.read_sql_query(companiesnotcompliant, engine)
scooterstriptime

This cell above highlights those not in complaince with the trips over 24 hour rule & the trips under 1 minute rule.

In [ ]:
 companiescompliant = '''
SELECT 'under 24' as status, companyname
FROM trips
WHERE tripduration <= 1440
GROUP BY companyname
UNION
SELECT 'over 1 minute' as status, companyname
FROM trips
WHERE tripduration > 1
GROUP BY companyname
ORDER BY status
'''
scooterstriptime= pd.read_sql_query(companiescompliant, engine)
scooterstriptime

All companies that are complaint with one or the other rules given.

In [ ]:
TRUECOMPLIANCE ='''
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS WHERE  UPPER(companyname) NOT IN 
(SELECT  COMPANYNAME FROM
(
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
UNION
SELECT 
UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1) 
GROUP BY COMPANYNAME)
GROUP BY
UPPER(companyname) 
'''
COMPLIANT= pd.read_sql_query(TRUECOMPLIANCE, engine)
COMPLIANT

GOTCHA and JUMP are the only companies according to our data that are in compliance with both parameters given to us.

3.

The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [ ]:
SCOOTERUSAGE = '''
SELECT 
T.*
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440
'''
USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

#Mob coding used.

In [ ]:
SCOOTERUSAGE = '''
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNT
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) >1
ORDER BY STARTDATE,UPPER(COMPANYNAME)
'''
USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

In [12]:
AVGUSAGE = '''
WITH avg_count AS (
SELECT companyname, sumdid, ROUND(AVG(scooter_usage.sumdid_count),2) as avg_sumdid_count
FROM (
SELECT companyname, sumdid, DATE(create_dt) as usage_date, COUNT(*) as sumdid_count
FROM trips
GROUP BY sumdid, DATE(create_dt), companyname
    ) as scooter_usage
GROUP BY sumdid, companyname
ORDER BY avg_sumdid_count DESC
)
SELECT companyname, sumdid, avg_sumdid_count
FROM avg_count
WHERE avg_sumdid_count >= 3.0
'''

AVGUSAGEBYDAY = pd.read_sql_query(AVGUSAGE, engine)
AVGUSAGEBYDAY

#Mob coding used. Query above is showing the average number of trips per scooter per company

,companyname,sumdid,avg_sumdid_count
0,JUMP,Poweredb671ffe4-2bca-5880-98ec-d36f65aa11a2,159.00
1,Bird,PoweredUNKNOWN,41.06
2,Lyft,Powered487723,21.50
3,Lime,PoweredEGRN7CFK6Q6K2,18.40
4,Gotcha,Powered569,18.00
...,...,...,...
2748,Bird,Powered2GR7G,3.00
2749,Bolt Mobility,Powered-44c78418-a8f1-ff86-c13e-eb8fdb8ddd6c,3.00
2750,Bird,PoweredBCB85,3.00
2751,Gotcha,Powered772,3.00
2752,Bird,PoweredEMPL7,3.00

In [13]:
SCOOTERUSAGEAVGCOM = '''
WITH X AS (
SELECT
COMPANYNAME,
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
CASE WHEN SUM(COUNTRECNUM) = 0 THEN 0 ELSE
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)))
END AVG_USE_DAY
FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME))
GROUP BY COMPANYNAME
)
SELECT COMPANYNAME, round(AVG_USE_DAY,2) AVG_USE_DAY FROM X 
'''

USESCOOTERCOM = pd.read_sql_query (SCOOTERUSAGEAVGCOM, engine)
USESCOOTERCOM

#Code that our team leader sent to us. Query above is showing the average number of trips per scooter per company

     companyname  avg_use_day
0           BIRD         0.32
1  BOLT MOBILITY         0.48
2         GOTCHA         0.24
3           JUMP         0.17
4           LIME         1.35
5           LYFT         0.69
6           SPIN         0.48